app/Controllers/Dashboard.php

    public function index()
    {
        $data = [
            'controller'        => 'Dashboard',
            'title'             => 'Dashboard',
            'total_admin'       => $this->adminModel->select('COUNT(id_admin) as total_admin')->first(),
            'total_project' => $this->projectModel->select('COUNT(id_project) as total_project')->first(),
            'total_vendor' => $this->vendorModel->select('COUNT(id_vendor) as total_vendor')->first(),
            'total_pegawai' => $this->pegawaiModel->select('COUNT(id_pegawai) as total_pegawai')->first(),
            'total_project_vendor' => $this->db->table('project_vendor')->select('COUNT(vendor_id) as total_project_vendor')->get()->getFirstRow(),
            'total_project_pegawai' => $this->db->table('project_pegawai')->select('COUNT(pegawai_id) as total_project_pegawai')->get()->getFirstRow(),
---
SELECT COUNT(id_admin) as total_admin
FROM `admin`
 LIMIT 1
SELECT COUNT(id_project) as total_project
FROM `project`
 LIMIT 1
SELECT COUNT(id_vendor) as total_vendor
FROM `vendor`
 LIMIT 1
SELECT COUNT(id_pegawai) as total_pegawai
FROM `pegawai`
 LIMIT 1
SELECT COUNT(vendor_id) as total_project_vendor
FROM `project_vendor`
SELECT COUNT(pegawai_id) as total_project_pegawai
FROM `project_pegawai`

    public function getAllProjectVendor()
    {
        $response = $data['data'] = array();

        $db = db_connect();
        if (session()->get('level') == 'Vendor') {
            $result = $db->table('vw_project_vendor')->select('*')->where('id_vendor', session()->get('id'))->get()->getResultObject();
        } else if (session()->get('level') == 'Admin') {
            $result = $db->table('vw_project_vendor')->select('*')->get()->getResultObject();
---
SELECT *
FROM `vw_project_vendor`

    public function getAllProjectPegawai()
    {
        $response = $data['data'] = array();

        $db = db_connect();
        if (session()->get('level') == 'Pegawai') {
            $result = $db->table('vw_project_pegawai')->select('*')->where('id_pegawai', session()->get('id'))->get()->getResultObject();
        } else if (session()->get('level') == 'Admin') {
            $result = $db->table('vw_project_pegawai')->select('*')->get()->getResultObject();
---
SELECT *
FROM `vw_project_pegawai`