app/Controllers/Project.php

SELECT *
FROM `pegawai`
SELECT *
FROM `vendor`
---
  	public function sendEmailDaily() {
		date_default_timezone_set('Asia/Jakarta');
   		$resultPegawai = $this->pegawaiModel->findAll();
        $resultVendor = $this->vendorModel->findAll();

SELECT *
FROM `pegawai`
WHERE `pegawai`.`id_pegawai` = '5'
---
	public static function sendMailPegawaiDaily($id_pegawai)
	{
	    $pegawaiModel =new PegawaiModel();
        $getEmail = $pegawaiModel->find($id_pegawai);

SELECT *
FROM `vendor`
WHERE `vendor`.`id_vendor` = '2'
---
	public static function sendMailVendorDaily($id_vendor)
	{
	    $vendorModel = new VendorModel();
      	$getEmail = $vendorModel->find($id_vendor);