app/Controllers/Projectvendor.php

    public function getAll()
    {
        $response = $data['data'] = array();

        $db = db_connect();
        if (session()->get('level') == 'Vendor') {
            $result = $db->table('vw_project_vendor')->select('*')->where('id_vendor', session()->get('id'))->get()->getResultObject();
        } else if (session()->get('level') == 'Admin') {
            $result = $db->table('vw_project_vendor')->select('*')->get()->getResultObject();
---
SELECT *
FROM `vw_project_vendor`