app/Controllers/Projectpegawai.php

SELECT *
FROM `vw_project_pegawai`
SELECT *
FROM `vendor`
JOIN `project_vendor` ON `vendor`.`id_vendor` = `project_vendor`.`vendor_id`
WHERE `vendor`.`id_role` = 3
SELECT *
FROM `vendor`
JOIN `project_vendor` ON `vendor`.`id_vendor` = `project_vendor`.`vendor_id`
WHERE `vendor`.`id_role` = 4
---
    public function getAll()
    {
        $response = $data['data'] = array();

        $db = db_connect();
        if (session()->get('level') == 'Pegawai') {
            $result = $db->table('vw_project_pegawai')->select('*')->where('id_pegawai', session()->get('id'))->get()->getResultObject();
        } else if (session()->get('level') == 'Admin') {
            $result = $db->table('vw_project_pegawai')->select('*')->get()->getResultObject();
        } else {
            $result = NULL;
        }
        $linkprojectRoleOne = $db->table('vendor')->select('*')
        ->join('project_vendor', 'vendor.id_vendor = project_vendor.vendor_id')
        ->where('vendor.id_role', 3)
        ->get()->getRowObject();
        $linkprojectRoleTwo = $db->table('vendor')->select('*')
        ->join('project_vendor', 'vendor.id_vendor = project_vendor.vendor_id')
        ->where('vendor.id_role', 4)
        ->get()->getRowObject();