app/Views/cronjob.php

	$db = db_connect();

	if($filter == 'pegawai') {
    	$getPegawai = $db->table('pegawai')->getWhere(['id_pegawai' => $id])->getRowArray();
		$getProjectPegawai = $db->table('vw_project_pegawai')->getWhere(['id_pegawai' => $id])->getResultArray();
    }else{
        $getVendor = $db->table('vendor')->getWhere(['id_vendor' => $id])->getRowArray();
		$getProjectVendor = $db->table('vw_project_vendor')->getWhere(['id_vendor' => $id])->getResultArray();
---
SELECT *
FROM `pegawai`
WHERE `id_pegawai` = '5'
SELECT *
FROM `vw_project_pegawai`
WHERE `id_pegawai` = '5'
SELECT *
FROM `vendor`
WHERE `id_vendor` = '2'
SELECT *
FROM `vw_project_vendor`
WHERE `id_vendor` = '2'